blog/2021/javascript-factory-functions.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 17:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JavaScript 工厂函数</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">JavaScript 工厂函数</h1>
</header><p>
<a href="https://www.javascripttutorial.net/javascript-factory-functions/">https://www.javascripttutorial.net/javascript-factory-functions/</a>
</p>

<p>
工厂函数能够返回新的对象。创建一个名为 <code>xiaoming</code> 的人物对象：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">xiaoming</span> = {
    firstName: <span style="color: #ddbc91;">"xiaoming"</span>,
    lastName: <span style="color: #ddbc91;">"Li"</span>,
    getFullName() {
        <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">this</span>.lastName + <span style="color: #ddbc91;">' '</span> + <span style="color: #ab85a3;">this</span>.firstName;
    }
};
console.log(xiaoming.getFullName());
</pre>
</div>

<p>
Output:
</p>

<div class="org-src-container">
<pre class="src src-sh">Li xiaoming
</pre>
</div>

<p>
<code>xiaoming</code> 对象有两个属性 <code>firstName</code> 和 <code>lastName</code> ，和一个用于返回全名的方法 <code>getFullName()</code> 。
</p>

<p>
假设你想新建一个类似对象 <code>xiaohua</code> ，可以直接替换以上代码的关键字。如果你想创建更多人物，直接复制就好。
</p>

<p>
为了避免重复复制相同代码，可以创建一个创建 <code>person</code> 对象的函数：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">function</span> <span style="color: #a9df90;">createPerson</span>(<span style="color: #aaca86;">firstName</span>, <span style="color: #aaca86;">lastName</span>) {
  <span style="color: #91a0b3;">return</span> {
    firstName: firstName,
    lastName: lastName,
    getFullName() {
      <span style="color: #91a0b3;">return</span> lastName + <span style="color: #ddbc91;">' '</span> + firstName;
    }
  }
}
</pre>
</div>

<p>
能够创建对象的函数，就是工厂函数。 <code>createPerson()</code> 是一个工厂函数，因为它返回了新的 <code>person</code> 对象。
</p>

<p>
现在使用 <code>createPerson()</code> 工厂函数创建两个对象 <code>xiaoming</code> 和 <code>xiaohua</code> ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">xiaoming</span> = createPerson(<span style="color: #ddbc91;">"xiaoming"</span>, <span style="color: #ddbc91;">"Li"</span>),
    xiaohua = createPerson(<span style="color: #ddbc91;">"xiaohua"</span>, <span style="color: #ddbc91;">"Li"</span>);
console.log(xiaoming.getFullName());
console.log(xiaohua.getFullName());
</pre>
</div>

<p>
对象的创建是在内存中开辟出一块空间，如果你有很多个对象，就会占用大量的内存空间。具体到 <code>person</code> 对象，它有一个重复的 <code>getFullName()</code> 方法。
</p>

<p>
为了避免在内存中重复相同的 <code>getFullName()</code> 函数，可以从 <code>person</code> 对象中移除它，另创建一个新的对象表达它：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">function</span> <span style="color: #a9df90;">createPerson</span>(<span style="color: #aaca86;">firstName</span>, <span style="color: #aaca86;">lastName</span>) {
  <span style="color: #91a0b3;">return</span> {
    firstName: firstName,
    lastName: lastName,
 }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">behavior</span> = {
    getFullName() {
      <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">this</span>.lastName + <span style="color: #ddbc91;">' '</span> + <span style="color: #ab85a3;">this</span>.firstName;
    }
}
</pre>
</div>

<p>
修改后的全部代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">function</span> <span style="color: #a9df90;">createPerson</span>(<span style="color: #aaca86;">firstName</span>, <span style="color: #aaca86;">lastName</span>) {
  <span style="color: #91a0b3;">return</span> {
    firstName: firstName,
    lastName: lastName
  }
}

<span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">behavior</span> = {
  getFullName() {
    <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">this</span>.lastName + <span style="color: #ddbc91;">' '</span> + <span style="color: #ab85a3;">this</span>.firstName;
  }
}

<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">xiaoming</span> = createPerson(<span style="color: #ddbc91;">"xiaoming"</span>, <span style="color: #ddbc91;">"Li"</span>),
    xiaohua = createPerson(<span style="color: #ddbc91;">"xiaohua"</span>, <span style="color: #ddbc91;">"Li"</span>);

xiaoming.getFullName = behavior.getFullName;
xiaohua.getFullName = behavior.getFullName;

console.log(xiaoming.getFullName());
console.log(xiaohua.getFullName());
</pre>
</div>

<p>
但是这样做并不利于添加更多方法，于是就有了 <code>Object.create()</code> 方法。
</p>

<div id="outline-container-org787958a" class="outline-2">
<h2 id="org787958a"><code>Object.create()</code> 方法</h2>
<div class="outline-text-2" id="text-org787958a">
<p>
<code>Object.create()</code> 方法创建新的对象，将已存在的对象作为新对象的原型（prototype）：
</p>

<div class="org-src-container">
<pre class="src src-js">Object.create(proto, [propertiesObject])
</pre>
</div>

<p>
加入 <code>Object.create()</code> 以后的代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">behavior</span> = {
  getFullName() {
    <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">this</span>.lastName + <span style="color: #ddbc91;">' '</span> + <span style="color: #ab85a3;">this</span>.firstName;
  }
}

<span style="color: #91a0b3;">function</span> <span style="color: #a9df90;">createPerson</span>(<span style="color: #aaca86;">firstName</span>, <span style="color: #aaca86;">lastName</span>) {
  <span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">person</span> = Object.create(behavior);
  person.firstName = firstName;
  person.lastName = lastName;
  <span style="color: #91a0b3;">return</span> person;
}


<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">xiaoming</span> = createPerson(<span style="color: #ddbc91;">"xiaoming"</span>, <span style="color: #ddbc91;">"Li"</span>),
    xiaohua = createPerson(<span style="color: #ddbc91;">"xiaohua"</span>, <span style="color: #ddbc91;">"Li"</span>);

console.log(xiaoming.getFullName());
console.log(xiaohua.getFullName());
</pre>
</div>

<p>
不是很理解这段代码。
</p>

<p>
但是在实践中，很少见到「工厂函数」，更多见的是「函数构造函数（function constructors）」或「类」。</p>
</div>
</div>
</div>
</body>
</html>